Revit 2027 API
RebarShapeDefinitionBySegments.AddListeningDimensionSegmentToBend Method
 Specify a dimension perpendicular to one fixed-direction segment, referring to that segment and some other bend in the shape, measured by a read-only parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddListeningDimensionSegmentToBend(
	ElementId paramId,
	double constraintDirCoordX,
	double constraintDirCoordY,
	int iSegment0,
	int iSegment1,
	int iEnd1
)
Public Sub AddListeningDimensionSegmentToBend (
	paramId As ElementId,
	constraintDirCoordX As Double,
	constraintDirCoordY As Double,
	iSegment0 As Integer,
	iSegment1 As Integer,
	iEnd1 As Integer
)
public:
void AddListeningDimensionSegmentToBend(
	ElementId^ paramId,
	double constraintDirCoordX,
	double constraintDirCoordY,
	int iSegment0,
	int iSegment1,
	int iEnd1
)
member AddListeningDimensionSegmentToBend :
        paramId : ElementId *
        constraintDirCoordX : float *
        constraintDirCoordY : float *
        iSegment0 : int *
        iSegment1 : int *
        iEnd1 : int -> unit
Parameters
paramId ElementId
 Id of a parameter to report the length of the dimension. The parameter will be read-only on Rebar instances.
constraintDirCoordX Double
 The x-coordinate of a 2D vector specifying the constraint direction.
constraintDirCoordY Double
 The y-coordinate of a 2D vector specifying the constraint direction.
iSegment0 Int32
 Index of the first segment (0 to NumberOfSegments - 1).
iSegment1 Int32
 Index of the second segment (0 to NumberOfSegments - 1).
iEnd1 Int32
 End (0 or 1) of the second segment.
Exceptions
Exception | Condition
ArgumentException |  paramId is not the id of a shared parameter in the current document, or its unit type is not Reinforcement_Length, Angle or Number. -or- The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero. -or- iSegment0 is not between 0 and NumberOfSegments. -or- Edge iSegment0 has a variable angle; it must have a fixed angle perpendicular to (constraintDirCoordX, constraintDirCoordY). -or- iSegment1 is not between 0 and NumberOfSegments. -or- iEnd1 is neither 0 nor 1.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace